{
  "hero.greeting": " Hola, soy Joaquina",
  "hero.title": "Bienvenido a mi Portafolio.",
  "hero.subtitle": "Desarrolladora Full Stack 路  Ingeniera en Sistemas",
  "hero.cta": "驴Te gustar铆a sumarme a tu equipo?",
  "stats.experience": "+2 A帽os de Experiencia",
  "stats.projects": "+5 Proyectos Completados",
  "stats.tech": "+10 Tecnolog铆as Dominadas",
  "stats.commitment": "100% Comprometida",
  "about.title": "Perfil Profesional",
  "about.description": "Soy estudiante de Ingenier铆a en Sistemas desde 2020, con s贸lidos conocimientos en desarrollo de software y tecnolog铆as de la informacif贸n. Estoy buscando una oportunidad laboral que me permita aplicar mis habilidades, seguir creciendo profesionalmente y contribuir en un entorno din谩mico y desafiante.",
  "education.title": "Educaci贸n",
  "education.utn": "Universidad Tecnol贸gica Nacional de Rosario",
  "education.utn_year": "2020 - Presente",
  "education.utn_degree": "Ingenier铆a en Sistemas",
  "education.utn_status": "Estudiante de 4to a帽o",
  "education.escuela": "Escuela Superior de Comercio 'Libertador General San Mart铆n'",
  "education.escuela_year": "2015 - 2019",
  "education.escuela_degree": "Bachiller en Econom铆a",
  "languages.title": "Idiomas",
  "languages.spanish": "Espa帽ol",
  "languages.spanish_level": "Nativo",
  "languages.english": "Ingl茅s",
  "languages.english_year": "Desde 2007",
  "languages.english_level": "Avanzado (Cert. Cambridge)",
  "languages.english_note": "",
  "navbar.home": "Inicio",
  "navbar.about": "Sobre M铆",
  "navbar.experience": "Experiencia",
  "navbar.projects": "Proyectos",
  "navbar.skills": "Habilidades",
  "navbar.contact": "Contacto",
  "navbar.download_cv": "Descargar CV",
  "experience.title": "Experiencia Laboral",
  "experience.description": "Mi experiencia profesional en soporte t茅cnico y desarrollo de soluciones tecnol贸gicas.",
  "experience.job1.title": "Soporte Inform谩tico",
  "experience.job1.company": "Asociaci贸n de Cooperativas Argentinas",
  "experience.job1.period": "Mar 2025 - Actualidad",
  "experience.job1.role": "Soporte Inform谩tico de Nivel 1",
  "experience.job1.desc1": "Soporte t茅cnico de primer nivel y resoluci贸n de incidencias en mesa de ayuda (Help Desk)",
  "experience.job1.desc2": "Gesti贸n de infraestructura y administraci贸n de entornos Microsoft",
  "experience.job1.desc3": "Automatizaci贸n de procesos con Jira y datos externos, mejorando la eficiencia operativa",
  "experience.job1.desc4": "Colaboraci贸n con el 谩rea de Tecnolog铆a de la Informaci贸n en proyectos de mejora continua",
  "experience.job1.tech1": "Microsoft Windows",
  "experience.job1.tech2": "Office 365",
  "experience.job1.tech3": "Cortex",
  "experience.job1.tech4": "Active Directory",
  "experience.job1.tech5": "Citrix",
  "experience.job1.tech6": "Jira",
  "experience.job2.title": "Soporte Inform谩tico",
  "experience.job2.company": "Tribunal de Faltas",
  "experience.job2.period": "Mar 2024 - Feb 2025",
  "experience.job2.desc1": "Mantenimiento y actualizaci贸n de sistemas hardware y software, implementaci贸n de nuevas tecnolog铆as",
  "experience.job2.desc2": "Testing de nuevas implementaciones y relevamiento de datos",
  "experience.job2.desc3": "Asesoramiento y capacitaci贸n a usuarios finales",
  "experience.job2.desc4": "Elaboraci贸n de manuales e instructivos t茅cnicos",
  "experience.job2.desc5": "Optimizaci贸n de procesos y mejora continua del 谩rea de IT",
  "experience.job2.tech1": "Windows",
  "experience.job2.tech2": "Linux",
  "experience.job2.tech3": "Hardware",
  "experience.job2.tech4": "Software",
  "experience.job2.tech5": "Documentaci贸n",
  "projects.title": "Proyectos",
  "projects.description": "Desarrollo full-stack con arquitecturas modernas, APIs REST y bases de datos relacionales.",
  "projects.alojarg.title": " AlojARG",
  "projects.alojarg.subtitle": "Sistema de Reservas",
  "projects.alojarg.description": "<strong>Proyecto Seminario Integrador:</strong> Sistema completo de gesti贸n y reserva de alojamientos tur铆sticos en Argentina, desarrollado como proyecto final de carrera.<br/><strong>Tecnolog铆as:</strong> .NET 9, Angular 20, TypeScript, MySQL, bajo arquitectura Clean Architecture para mantener el c贸digo modular y escalable.<br/><strong>Caracter铆sticas clave:</strong> API RESTful con autenticaci贸n JWT y validaciones FluentValidation, integraci贸n con API externa de hoteles (Makcorps), b煤squeda avanzada con filtros din谩micos, sistema de favoritos, comparador de propiedades y dashboard administrativo.<br/><strong>Herramientas:</strong> Entity Framework Core para ORM, Swagger/OpenAPI para documentaci贸n, Docker Compose para despliegue en contenedores.<br/><em>Este proyecto afianz贸 conocimientos en desarrollo full stack, arquitectura escalable y buenas pr谩cticas de ingenier铆a de software.</em>",
  "projects.libros.title": " BookCode",
  "projects.libros.subtitle": "Sistema de Gesti贸n de Libros",
  "projects.libros.description": "<strong>Proyecto Desarrollo de Software:</strong> BookCode es un sistema web full stack completo para gesti贸n y rese帽as de libros, dise帽ado para ofrecer una experiencia interactiva y personalizada a los usuarios.<br/><strong>Tecnolog铆as:</strong> Frontend con React, HTML y CSS; Backend con Node.js, Express y TypeScript; Base de datos MySQL con ORM MikroORM.<br/><strong>Funcionalidades:</strong> CRUD m煤ltiple para usuarios, libros, autores, categor铆as, editoriales y sagas; sistema de rese帽as con calificaciones y comentarios; listas personalizadas (\"Le铆dos\", \"Pendientes\", \"Ver m谩s tarde\"); recomendaciones personalizadas y reacciones a rese帽as.<br/><strong>Caracter铆sticas:</strong> Autenticaci贸n segura con tokens JWT, moderaci贸n de rese帽as mediante API externa de detecci贸n de malas palabras, relaciones dependientes complejas entre entidades, seguimiento de actividades entre usuarios.<br/><em>Proyecto que incluy贸 dise帽o y normalizaci贸n de base de datos, construcci贸n de backend modular, integraci贸n de APIs externas y gesti贸n con Git/GitHub.</em>",
  "projects.stock.title": " Gesti贸n de Stock",
  "projects.stock.description": "<strong>Proyecto Desarrollo de Software:</strong> Prototipo full stack de gesti贸n de stock, desarrollado como proyecto inicial de la materia para aplicar conceptos aprendidos.<br/><strong>Tecnolog铆as:</strong> Frontend con React y TailwindCSS para UI moderna; Backend con Node.js, Express y TypeScript; Base de datos MySQL integrada con Prisma ORM.<br/><strong>Funcionalidades:</strong> CRUD completo de productos y categor铆as con filtrado din谩mico, control de inventario en tiempo real para seguimiento preciso de stock.<br/><strong>Caracter铆sticas:</strong> Dise帽o y normalizaci贸n completa de base de datos, construcci贸n de backend modular en TypeScript, configuraci贸n de servidor Express, integraci贸n fluida con Prisma para operaciones de datos.<br/><em>Este primer proyecto full stack consolid贸 conocimientos en desarrollo web, arquitectura de aplicaciones y buenas pr谩cticas de programaci贸n.</em>",
  "projects.hospital.title": " Sistema de Hospital",
  "projects.hospital.description": "<strong>Proyecto Algoritmos y Estructura de Datos:</strong> Programa funcional para gesti贸n hospitalaria desarrollado en la materia de algoritmos, aplicando estructuras de datos para manejo eficiente de informaci贸n.<br/><strong>Tecnolog铆as:</strong> Desarrollado principalmente en Python con complementos en Pascal, utilizando algoritmos y estructuras de datos para optimizar operaciones.<br/><strong>Funcionalidades:</strong> Registro completo de pacientes con informaci贸n detallada, b煤squeda eficiente por diversos criterios, gesti贸n de enfermedades y s铆ntomas asociados.<br/><strong>Caracter铆sticas:</strong> Base de datos actualizable y organizada que permite agregar nuevas enfermedades con sus s铆ntomas, garantizando un sistema flexible para gesti贸n de informaci贸n cl铆nica.<br/><em>Este proyecto acad茅mico consolid贸 conocimientos en algoritmos y estructuras de datos, aplic谩ndolos en un contexto pr谩ctico de gesti贸n de datos m茅dicos.</em>",
  "projects.fisica.title": " FISICAMODELO",
  "projects.fisica.subtitle": "Simulaciones interactivas en p5.js",
  "projects.fisica.description": "<strong>Simulaciones educativas interactivas:</strong> Colecci贸n de proyectos (avi贸n de ala fija y dron) desarrollados en p5.js. Visualizaciones en tiempo real de sustentaci贸n, arrastre y paneles num茅ricos (CL, CD, ). Incluye controles interactivos, visualizaci贸n de flujo, paneles de datos y tutoriales en espa帽ol para explicar Bernoulli y las leyes de Newton.",
  "skills.title": "Stack Tecnol贸gico",
  "skills.description": "Tecnolog铆as y herramientas que domino para construir soluciones robustas y escalables.",
  "skills.languages": "Lenguajes de Programaci贸n",
  "skills.frameworks": "Frameworks y Librer铆as",
  "skills.databases": "Bases de Datos",

  "skills.os": "Sistemas Operativos",
  "skills.office": "Herramientas de Oficina",
  "skills.design": "Dise帽o y Modelado",
  "skills.architecture": "Arquitectura de Sistemas",
  "contact.title": "Conectemos",
  "contact.description": "Estoy disponible para nuevas oportunidades, colaboraciones y proyectos interesantes.",
  "contact.cv": "Descargar CV",
  "contact.phone": "Tel茅fono",
  "contact.call": "Llamar",
  "contact.email": "Email",
  "contact.send": "Enviar mensaje",
  "contact.view": "Ver perfil",
  "contact.repos": "Ver repositorios",
  "contact.location": "Ubicaci贸n",
  "contact.download": "Descargar",
  "footer.description": "Ingeniera en Sistemas",
  "footer.navigation": "Navegaci贸n",
  "footer.social": "Redes Sociales",
  "footer.rights": "Todos los derechos reservados.",
  "footer.tech": "Desarrollado con React + Vite",
  "language.label": "Idioma:"
}
