{
  "hero.greeting": "游녦 Hola, soy Joaquina",
  "hero.title": "Bienvenido a mi Portafolio.",
  "hero.subtitle": "Desarrolladora Full Stack 췅  Ingeniera en Sistemas",
  "hero.cta": "쯊e gustar칤a sumarme a tu equipo?",
  "stats.experience": "+2 A침os de Experiencia",
  "stats.projects": "+5 Proyectos Completados",
  "stats.tech": "+10 Tecnolog칤as Dominadas",
  "stats.commitment": "100% Comprometida",
  "about.title": "Perfil Profesional",
  "about.description": "Soy estudiante de Ingenier칤a en Sistemas desde 2020, con s칩lidos conocimientos en desarrollo de software y tecnolog칤as de la informacif칩n. Estoy buscando una oportunidad laboral que me permita aplicar mis habilidades, seguir creciendo profesionalmente y contribuir en un entorno din치mico y desafiante.",
  "education.title": "Educaci칩n",
  "education.utn": "Universidad Tecnol칩gica Nacional de Rosario",
  "education.utn_year": "2020 - Presente",
  "education.utn_degree": "Ingenier칤a en Sistemas",
  "education.utn_status": "Estudiante de 4to a침o",
  "education.escuela": "Escuela Superior de Comercio 'Libertador General San Mart칤n'",
  "education.escuela_year": "2015 - 2019",
  "education.escuela_degree": "Bachiller en Econom칤a",
  "languages.title": "Idiomas",
  "languages.spanish": "Espa침ol",
  "languages.spanish_level": "Nativo",
  "languages.english": "Ingl칠s",
  "languages.english_year": "Desde 2007",
  "languages.english_level": "Avanzado (Cert. Cambridge)",
  "languages.english_note": "",
  "navbar.home": "Inicio",
  "navbar.about": "Sobre M칤",
  "navbar.experience": "Experiencia",
  "navbar.projects": "Proyectos",
  "navbar.skills": "Habilidades",
  "navbar.contact": "Contacto",
  "navbar.download_cv": "Descargar CV",
  "experience.title": "Experiencia Laboral",
  "experience.description": "Mi experiencia profesional en soporte t칠cnico y desarrollo de soluciones tecnol칩gicas.",
  "experience.job1.title": "Soporte Inform치tico",
  "experience.job1.company": "Asociaci칩n de Cooperativas Argentinas",
  "experience.job1.period": "Mar 2025 - Actualidad",
  "experience.job1.role": "Soporte Inform치tico de Nivel 1",
  "experience.job1.desc1": "Soporte t칠cnico de primer nivel y resoluci칩n de incidencias en mesa de ayuda (Help Desk)",
  "experience.job1.desc2": "Gesti칩n de infraestructura y administraci칩n de entornos Microsoft",
  "experience.job1.desc3": "Automatizaci칩n de procesos con Jira y datos externos, mejorando la eficiencia operativa",
  "experience.job1.desc4": "Colaboraci칩n con el 치rea de Tecnolog칤a de la Informaci칩n en proyectos de mejora continua",
  "experience.job1.tech1": "Microsoft Windows",
  "experience.job1.tech2": "Office 365",
  "experience.job1.tech3": "Cortex",
  "experience.job1.tech4": "Active Directory",
  "experience.job1.tech5": "Citrix",
  "experience.job1.tech6": "Jira",
  "experience.job2.title": "Soporte Inform치tico",
  "experience.job2.company": "Tribunal de Faltas",
  "experience.job2.period": "Mar 2024 - Feb 2025",
  "experience.job2.desc1": "Mantenimiento y actualizaci칩n de sistemas hardware y software, implementaci칩n de nuevas tecnolog칤as",
  "experience.job2.desc2": "Testing de nuevas implementaciones y relevamiento de datos",
  "experience.job2.desc3": "Asesoramiento y capacitaci칩n a usuarios finales",
  "experience.job2.desc4": "Elaboraci칩n de manuales e instructivos t칠cnicos",
  "experience.job2.desc5": "Optimizaci칩n de procesos y mejora continua del 치rea de IT",
  "experience.job2.tech1": "Windows",
  "experience.job2.tech2": "Linux",
  "experience.job2.tech3": "Hardware",
  "experience.job2.tech4": "Software",
  "experience.job2.tech5": "Documentaci칩n",
  "projects.title": "Proyectos",
  "projects.description": "Desarrollo full-stack con arquitecturas modernas, APIs REST y bases de datos relacionales.",
  "projects.alojarg.title": "游낃 AlojARG",
  "projects.alojarg.subtitle": "Sistema de Reservas",
  "projects.alojarg.description": "<strong>Proyecto Seminario Integrador:</strong> Sistema completo de gesti칩n y reserva de alojamientos tur칤sticos en Argentina, desarrollado como proyecto final de carrera.<br/><strong>Tecnolog칤as:</strong> .NET 9, Angular 20, TypeScript, MySQL, bajo arquitectura Clean Architecture para mantener el c칩digo modular y escalable.<br/><strong>Caracter칤sticas clave:</strong> API RESTful con autenticaci칩n JWT y validaciones FluentValidation, integraci칩n con API externa de hoteles (Makcorps), b칰squeda avanzada con filtros din치micos, sistema de favoritos, comparador de propiedades y dashboard administrativo.<br/><strong>Herramientas:</strong> Entity Framework Core para ORM, Swagger/OpenAPI para documentaci칩n, Docker Compose para despliegue en contenedores.<br/><em>Este proyecto afianz칩 conocimientos en desarrollo full stack, arquitectura escalable y buenas pr치cticas de ingenier칤a de software.</em>",
  "projects.libros.title": "游닄 BookCode",
  "projects.libros.subtitle": "Sistema de Gesti칩n de Libros",
  "projects.libros.description": "<strong>Proyecto Desarrollo de Software:</strong> BookCode es un sistema web full stack completo para gesti칩n y rese침as de libros, dise침ado para ofrecer una experiencia interactiva y personalizada a los usuarios.<br/><strong>Tecnolog칤as:</strong> Frontend con React, HTML y CSS; Backend con Node.js, Express y TypeScript; Base de datos MySQL con ORM MikroORM.<br/><strong>Funcionalidades:</strong> CRUD m칰ltiple para usuarios, libros, autores, categor칤as, editoriales y sagas; sistema de rese침as con calificaciones y comentarios; listas personalizadas (\"Le칤dos\", \"Pendientes\", \"Ver m치s tarde\"); recomendaciones personalizadas y reacciones a rese침as.<br/><strong>Caracter칤sticas:</strong> Autenticaci칩n segura con tokens JWT, moderaci칩n de rese침as mediante API externa de detecci칩n de malas palabras, relaciones dependientes complejas entre entidades, seguimiento de actividades entre usuarios.<br/><em>Proyecto que incluy칩 dise침o y normalizaci칩n de base de datos, construcci칩n de backend modular, integraci칩n de APIs externas y gesti칩n con Git/GitHub.</em>",
  "projects.stock.title": "游닍 Gesti칩n de Stock",
  "projects.stock.description": "<strong>Proyecto Desarrollo de Software:</strong> Prototipo full stack de gesti칩n de stock, desarrollado como proyecto inicial de la materia para aplicar conceptos aprendidos.<br/><strong>Tecnolog칤as:</strong> Frontend con React y TailwindCSS para UI moderna; Backend con Node.js, Express y TypeScript; Base de datos MySQL integrada con Prisma ORM.<br/><strong>Funcionalidades:</strong> CRUD completo de productos y categor칤as con filtrado din치mico, control de inventario en tiempo real para seguimiento preciso de stock.<br/><strong>Caracter칤sticas:</strong> Dise침o y normalizaci칩n completa de base de datos, construcci칩n de backend modular en TypeScript, configuraci칩n de servidor Express, integraci칩n fluida con Prisma para operaciones de datos.<br/><em>Este primer proyecto full stack consolid칩 conocimientos en desarrollo web, arquitectura de aplicaciones y buenas pr치cticas de programaci칩n.</em><br/><strong>Contacto de referencia:</strong> Eva Bellini, Cel: (54) 341 323 4724",
  "projects.hospital.title": "游낀 Sistema de Hospital",
  "projects.hospital.description": "<strong>Proyecto Algoritmos y Estructura de Datos:</strong> Programa funcional para gesti칩n hospitalaria desarrollado en la materia de algoritmos, aplicando estructuras de datos para manejo eficiente de informaci칩n.<br/><strong>Tecnolog칤as:</strong> Desarrollado principalmente en Python con complementos en Pascal, utilizando algoritmos y estructuras de datos para optimizar operaciones.<br/><strong>Funcionalidades:</strong> Registro completo de pacientes con informaci칩n detallada, b칰squeda eficiente por diversos criterios, gesti칩n de enfermedades y s칤ntomas asociados.<br/><strong>Caracter칤sticas:</strong> Base de datos actualizable y organizada que permite agregar nuevas enfermedades con sus s칤ntomas, garantizando un sistema flexible para gesti칩n de informaci칩n cl칤nica.<br/><em>Este proyecto acad칠mico consolid칩 conocimientos en algoritmos y estructuras de datos, aplic치ndolos en un contexto pr치ctico de gesti칩n de datos m칠dicos.</em>",
  "skills.title": "Stack Tecnol칩gico",
  "skills.description": "Tecnolog칤as y herramientas que domino para construir soluciones robustas y escalables.",
  "skills.languages": "Lenguajes de Programaci칩n",
  "skills.frameworks": "Frameworks y Librer칤as",
  "skills.databases": "Bases de Datos",

  "skills.os": "Sistemas Operativos",
  "skills.office": "Herramientas de Oficina",
  "skills.design": "Dise침o y Modelado",
  "skills.architecture": "Arquitectura de Sistemas",
  "contact.title": "Conectemos",
  "contact.description": "Estoy disponible para nuevas oportunidades, colaboraciones y proyectos interesantes.",
  "contact.cv": "Descargar CV",
  "contact.phone": "Tel칠fono",
  "contact.call": "Llamar",
  "contact.email": "Email",
  "contact.send": "Enviar mensaje",
  "contact.view": "Ver perfil",
  "contact.repos": "Ver repositorios",
  "contact.location": "Ubicaci칩n",
  "contact.download": "Descargar",
  "footer.description": "Ingeniera en Sistemas especializada en desarrollo Full Stack.",
  "footer.navigation": "Navegaci칩n",
  "footer.social": "Redes Sociales",
  "footer.rights": "Todos los derechos reservados.",
  "footer.tech": "Desarrollado con React + Vite",
  "language.label": "Idioma:"
}
